In [1]:
%load_ext autotime

In [2]:
# imports and basic setup

time: 560 µs

In [3]:
import imp # need to be done for python 3
import logging
imp.reload(logging)
logging.basicConfig(format='%(asctime)s %(levelname)s:%(message)s', 
                    level=logging.DEBUG, datefmt='%I:%M:%S')

time: 5.1 ms

In [4]:
import sys
import os

time: 853 µs

In [5]:
sys.path.append('/Users/pradap/Documents/Research/Python-Package/anhaid/magellan/')

time: 835 µs

In [6]:
import magellan as mg

time: 2.28 s

In [11]:
path_a = os.sep.join([mg.get_install_path(), 'datasets', 'table_A.csv'])
path_b = os.sep.join([mg.get_install_path(), 'datasets', 'table_B.csv'])

time: 1.36 ms

In [12]:
A = mg.read_csv_metadata(path_a)
B = mg.read_csv_metadata(path_b)

time: 6.78 ms

In [13]:
# blocker 1
ob = mg.OverlapBlocker()
C = ob.block_tables(A, B, 'name', 'name', word_level=True, overlap_size=1,
                   l_output_attrs=['name', 'birth_year'],
                   r_output_attrs=['name', 'birth_year'])

0%  100%
[######] | ETA: 00:00:00

candset cols: Index(['_id', 'ltable_ID', 'rtable_ID', 'ltable_name', 'ltable_birth_year',
       'rtable_name', 'rtable_birth_year'],
      dtype='object')
retain_cols: ['ltable_ID', 'rtable_ID', 'ltable_name', 'ltable_birth_year', 'rtable_name', 'rtable_birth_year']
time: 113 ms

Total time elapsed: 00:00:00

In [14]:
C

,_id,ltable_ID,rtable_ID,ltable_name,ltable_birth_year,rtable_name,rtable_birth_year
0,0,a3,b2,william bridge,1986,bridge bill,1986
1,1,a2,b3,michael franklin,1988,mike franklin,1988
2,2,a5,b5,kemper alphonse,1984,alfons kemper,1984
3,3,a2,b6,michael franklin,1988,michael brodie,1987

time: 23.7 ms

In [31]:
ab = mg.AttrEquivalenceBlocker()
D = ab.block_candset(C, 'birth_year', 'birth_year'
                     )

0%  100%
[####] | ETA: 00:00:00

time: 17.3 ms

Total time elapsed: 00:00:00

In [16]:
D

,_id,ltable_ID,rtable_ID,ltable_name,ltable_birth_year,rtable_name,rtable_birth_year
0,0,a3,b2,william bridge,1986,bridge bill,1986
1,1,a2,b3,michael franklin,1988,mike franklin,1988
2,2,a5,b5,kemper alphonse,1984,alfons kemper,1984

time: 9.85 ms

In [32]:
E = ab.block_tables(A, B, 'zipcode', 'zipcode', l_output_attrs=['zipcode'], r_output_attrs = ['zipcode'])

0%  100%
[#####] | ETA: 00:00:00

time: 17.9 ms

Total time elapsed: 00:00:00

In [18]:
def my_function(x, y):
    x_name = x['name']
    y_name = y['name']
    x_name = x_name.split(' ')[1]
    y_name = y_name.split(' ')[1]
    if x_name != y_name:
        return True
    else:
        return False

time: 3.18 ms

In [20]:
bb = mg.BlackBoxBlocker()
bb.set_black_box_function(my_function)

time: 1.04 ms

In [25]:
F = bb.block_tables(A, B, l_output_attrs=['name'], r_output_attrs=['name'])

0%                          100%
[##############################] | ETA: 00:00:00

time: 59 ms

Total time elapsed: 00:00:00

In [33]:
# blocker combiner
G = mg.combine_blocker_outputs_via_union([D, E, F])

time: 17.7 ms

In [34]:
G

,_id,ltable_ID,rtable_ID,ltable_name,ltable_birth_year,ltable_zipcode,rtable_name,rtable_birth_year,rtable_zipcode
0,0,a1,b1,Kevin Smith,1989,94107,Mark Levene,1987,94107
1,1,a1,b2,Kevin Smith,1989,94107,Bill Bridge,1986,94107
2,2,a1,b6,Kevin Smith,1989,94107,Michael Brodie,1987,94107
3,3,a2,b3,Michael Franklin,1988,94122,Mike Franklin,1988,94122
4,4,a2,b4,Michael Franklin,1988,94122,Joseph Kuan,1982,94122
5,5,a2,b5,Michael Franklin,1988,94122,Alfons Kemper,1984,94122
6,6,a3,b1,William Bridge,1986,94107,Mark Levene,1987,94107
7,7,a3,b2,William Bridge,1986,94107,Bill Bridge,1986,94107
8,8,a3,b6,William Bridge,1986,94107,Michael Brodie,1987,94107
9,9,a4,b3,Binto George,1987,94122,Mike Franklin,1988,94122
10,10,a4,b4,Binto George,1987,94122,Joseph Kuan,1982,94122
11,11,a4,b5,Binto George,1987,94122,Alfons Kemper,1984,94122
12,12,a5,b3,Alphonse Kemper,1984,94122,Mike Franklin,1988,94122
13,13,a5,b4,Alphonse Kemper,1984,94122,Joseph Kuan,1982,94122
14,14,a5,b5,Alphonse Kemper,1984,94122,Alfons Kemper,1984,94122

time: 15.2 ms